app/Controllers/Auth/Register.php

INSERT INTO `anggota` (`nama`, `nomor_anggota`, `email`, `alamat`, `nomor_telepon`, `password`) VALUES ('ghosya', 'AGT001', 'ghosya@gmail.com', '0897546321', 'ghosya1234', '$2y$10$KDyzV9dV7l35cVYWptOM6OwM1FoK7VrIPQscRIGhCmkSlRC9Q/YPe')
---
    public function index(){
        $rules = [
            'nama' => 'required',
            'email' => ['rules' => 'required|min_length[4]|max_length[255]|valid_email|is_unique[users.email]'],
            'alamat' => 'required',
            'nomor_telepon' => 'required',
            'password' => ['rules' => 'required|min_length[8]|max_length[255]']
        ];

        if($this->validate($rules)){
            $AnggotaModel = new AnggotaModel();
            $UserModel = new User();
            $newAnggotaNumber = $AnggotaModel->generateNewAnggotaNumber();
            $dataAngggota = [
                'nama' => $this->request->getVar('nama'),
                'nomor_anggota' => $newAnggotaNumber,
                'email' => $this->request->getVar('email'),
                'alamat' => $this->request->getVar('alamat'),
                'nomor_telepon' => $this->request->getVar('nomor_telepon'),
                'password' => $this->request->getVar('password'),
            ];

            $AnggotaModel->insert($dataAngggota);

INSERT INTO `users` (`email`, `password`, `role`, `id_anggota`) VALUES ('ghosya@gmail.com', '$2y$10$3AKuU7nFXhbaym5OK7nrvuIcXP1Tvsi/rwlZc8lxMQofugYyL9MIG', 'Anggota', 20)
---
                'nomor_anggota' => $newAnggotaNumber,
            ];

            $UserModel->insert($dataUser);