app/Controllers/Crud/PeminjamanOnlineController.php

SELECT `peminjaman_online`.*, `buku_digital`.`link`
FROM `peminjaman_online`
LEFT JOIN `buku_digital` ON `peminjaman_online`.`kode_buku` = `buku_digital`.`kode_buku`
WHERE `nomor_anggota` = 'AGT006'
---
    public function riwayatPeminjamanOnline($nomor_anggota = null)
    {
        $peminjaman = $this->peminjaman
            ->select('peminjaman_online.*, buku_digital.*')
            ->join('buku_digital', 'peminjaman_online.kode_buku = buku_digital.kode_buku', 'left')
            ->where('nomor_anggota', $nomor_anggota)
            ->findAll();