app/Models/AnggotaModel.php

SELECT *
FROM `anggota`
WHERE `nomor_anggota` = 'AGT005'
 LIMIT 1
---
    public function findByNomorAnggota($nomorAnggota)
    {
        return $this->where('nomor_anggota', $nomorAnggota)->first();