app/Models/BukuModel.php

SELECT `jumlah`
FROM `buku`
WHERE `kode_buku` = 'BK0005'
---
    public function getJumlah($kodeBuku){
        $query = $this->select('jumlah')->where('kode_buku',$kodeBuku)->get();

UPDATE `buku` SET `jumlah` = 4
WHERE `kode_buku` = 'BK0005'
---
    public function updateJumlahBuku($kodeBuku, $jumlah)
    {
        $this->where('kode_buku', $kodeBuku)->set('jumlah', $jumlah)->update();